sped/mdfe/homologacao/temporarias/201706/MG_20170623_172010-consNaoEnc.xml

<?xml version="1.0" encoding="utf-8"?><soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope"><soap12:Header><mdfeCabecMsg xmlns="http://www.portalfiscal.inf.br/mdfe/wsdl/MDFeConsNaoEnc"><cUF>31</cUF><versaoDados>1.0</versaoDados></mdfeCabecMsg></soap12:Header><soap12:Body><mdfeDadosMsg xmlns="http://www.portalfiscal.inf.br/mdfe/wsdl/MDFeConsNaoEnc"><consMDFeNaoEnc xmlns="http://www.portalfiscal.inf.br/mdfe" versao="3.0"><tpAmb>2</tpAmb><xServ>CONSULTAR NÃO ENCERRADOS</xServ><CNPJ>09204054000143</CNPJ></consMDFeNaoEnc></mdfeDadosMsg></soap12:Body></soap12:Envelope>